OpenFOAM case folders/Experimental validation/Calm water resistance/KVLCC2/Fr0.1515/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     controlDict;
}

libs                 ("libOpenFOAM.so" "libfvOptions.so" );
application          interFoam;
startFrom            latestTime;
startTime            0;
stopAt               endTime;
endTime              34.65;
deltaT               0.0495;
writeControl         adjustableRunTime;
writeInterval        0.3465;
purgeWrite           2;
writeFormat          ascii;
writePrecision       9;
writeCompression     off;
timeFormat           general;
timePrecision        9;
runTimeModifiable    yes;
adjustTimeStep       yes;
maxCo                40.0;
maxDeltaT            0.0495;
maxAlphaCo           10.0;

functions
{
	#include "forces";
}
