OpenFOAM case folders/Experimental validation/Calm water resistance/KVLCC2/Fr0.1515/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-11.075211435589631 0 -7.095057325924608)
	(16.612817153384444 0 -7.095057325924608)
	(16.612817153384444 8.133358398011136 -7.095057325924608)
	(-11.075211435589631 8.133358398011136 -7.095057325924608)
	(-11.075211435589631 0 2.768802858897408)
	(16.612817153384444 0 2.768802858897408)
	(16.612817153384444 8.133358398011136 2.768802858897408)
	(-11.075211435589631 8.133358398011136 2.768802858897408)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (160 47 57) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

