OpenFOAM case folders/Experimental validation/Calm water resistance/KVLCC2/Fr0.1515/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     transportProperties;;
}

phases (water air);

water
{
	transportModel    Newtonian;
	nu                nu [ 0 2 -1 0 0 0 0 ]  1.140e-06;
	rho               rho [ 1 -3 0 0 0 0 0 ] 999.100;
}

air
{
	transportModel    Newtonian;
	nu                nu [ 0 2 -1 0 0 0 0 ]  1.450e-05;
	rho               rho [ 1 -3 0 0 0 0 0 ] 1.226;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0;
